rodan/atlas430/glue/MSP430F5xx_6xx/clock_pin.c
/*
  pin setup for crystal-based clocks. 
  this file is generated automatically based on the device datasheets
  Author:          Petre Rodan <2b4eda@subdimension.ro>
  Available from:  https://github.com/rodan/reference_libs_msp430

  generated on Wed Nov 24 09:38:53 UTC 2021
*/

#include <msp430.h>

void clock_pin_init(void)
{
#ifdef USE_XT1

#if defined (__MSP430FR5041__) || defined (__MSP430FR50431__) \
 || defined (__MSP430FR5043__) || defined (__MSP430FR58471__) \
 || defined (__MSP430FR5847__) || defined (__MSP430FR5848__) \
 || defined (__MSP430FR5849__) || defined (__MSP430FR5857__) \
 || defined (__MSP430FR5858__) || defined (__MSP430FR5859__) \
 || defined (__MSP430FR58671__) || defined (__MSP430FR5867__) \
 || defined (__MSP430FR5868__) || defined (__MSP430FR5869__) \
 || defined (__MSP430FR5870__) || defined (__MSP430FR58721__) \
 || defined (__MSP430FR5872__) || defined (__MSP430FR5887__) \
 || defined (__MSP430FR5888__) || defined (__MSP430FR58891__) \
 || defined (__MSP430FR5889__) || defined (__MSP430FR59221__) \
 || defined (__MSP430FR5922__) || defined (__MSP430FR59471__) \
 || defined (__MSP430FR5947__) || defined (__MSP430FR5948__) \
 || defined (__MSP430FR5949__) || defined (__MSP430FR5957__) \
 || defined (__MSP430FR5958__) || defined (__MSP430FR5959__) \
 || defined (__MSP430FR5962__) || defined (__MSP430FR5964__) \
 || defined (__MSP430FR5967__) || defined (__MSP430FR5968__) \
 || defined (__MSP430FR59691__) || defined (__MSP430FR5969__) \
 || defined (__MSP430FR5970__) || defined (__MSP430FR59721__) \
 || defined (__MSP430FR5972__) || defined (__MSP430FR5986__) \
 || defined (__MSP430FR5987__) || defined (__MSP430FR5988__) \
 || defined (__MSP430FR59891__) || defined (__MSP430FR5989__) \
 || defined (__MSP430FR5992__) || defined (__MSP430FR59941__) \
 || defined (__MSP430FR5994__) || defined (__MSP430FR6005__) \
 || defined (__MSP430FR6007__) || defined (__MSP430FR6035__) \
 || defined (__MSP430FR60371__) || defined (__MSP430FR6037__) \
 || defined (__MSP430FR6041__) || defined (__MSP430FR60431__) \
 || defined (__MSP430FR6043__) || defined (__MSP430FR6045__) \
 || defined (__MSP430FR60471__) || defined (__MSP430FR6047__) \
 || defined (__MSP430FR6820__) || defined (__MSP430FR68221__) \
 || defined (__MSP430FR6822__) || defined (__MSP430FR6870__) \
 || defined (__MSP430FR68721__) || defined (__MSP430FR6872__) \
 || defined (__MSP430FR6877__) || defined (__MSP430FR68791__) \
 || defined (__MSP430FR6879__) || defined (__MSP430FR6887__) \
 || defined (__MSP430FR6888__) || defined (__MSP430FR68891__) \
 || defined (__MSP430FR6889__) || defined (__MSP430FR6920__) \
 || defined (__MSP430FR69221__) || defined (__MSP430FR6922__) \
 || defined (__MSP430FR69271__) || defined (__MSP430FR6927__) \
 || defined (__MSP430FR6928__) || defined (__MSP430FR6970__) \
 || defined (__MSP430FR69721__) || defined (__MSP430FR6972__) \
 || defined (__MSP430FR6977__) || defined (__MSP430FR69791__) \
 || defined (__MSP430FR6979__) || defined (__MSP430FR6987__) \
 || defined (__MSP430FR6988__) || defined (__MSP430FR69891__) \
 || defined (__MSP430FR6989__)

    PJSEL0 |= BIT6;
    PJSEL1 &= ~BIT6;

#elif defined (__MSP430F5333__) || defined (__MSP430F5335__) \
 || defined (__MSP430F5336__) || defined (__MSP430F5338__) \
 || defined (__MSP430F5358__) || defined (__MSP430F5359__) \
 || defined (__MSP430F5630__) || defined (__MSP430F5631__) \
 || defined (__MSP430F5632__) || defined (__MSP430F5633__) \
 || defined (__MSP430F5634__) || defined (__MSP430F5635__) \
 || defined (__MSP430F5636__) || defined (__MSP430F5637__) \
 || defined (__MSP430F5638__) || defined (__MSP430F5658__) \
 || defined (__MSP430F5659__) || defined (__MSP430F6433__) \
 || defined (__MSP430F6435__) || defined (__MSP430F6436__) \
 || defined (__MSP430F6438__) || defined (__MSP430F6458__) \
 || defined (__MSP430F6459__) || defined (__MSP430F6630__) \
 || defined (__MSP430F6631__) || defined (__MSP430F6632__) \
 || defined (__MSP430F6633__) || defined (__MSP430F6634__) \
 || defined (__MSP430F6635__) || defined (__MSP430F6636__) \
 || defined (__MSP430F6637__) || defined (__MSP430F6638__) \
 || defined (__MSP430F6658__) || defined (__MSP430F6659__) \
 || defined (__MSP430F6720__) || defined (__MSP430F6720A__) \
 || defined (__MSP430F6721__) || defined (__MSP430F6721A__) \
 || defined (__MSP430F6723__) || defined (__MSP430F6723A__) \
 || defined (__MSP430F6724__) || defined (__MSP430F6724A__) \
 || defined (__MSP430F6725__) || defined (__MSP430F6725A__) \
 || defined (__MSP430F6726__) || defined (__MSP430F6726A__) \
 || defined (__MSP430F6730__) || defined (__MSP430F6730A__) \
 || defined (__MSP430F6731__) || defined (__MSP430F6731A__) \
 || defined (__MSP430F6733__) || defined (__MSP430F6733A__) \
 || defined (__MSP430F6734__) || defined (__MSP430F6734A__) \
 || defined (__MSP430F6735__) || defined (__MSP430F6735A__) \
 || defined (__MSP430F6736__) || defined (__MSP430F6736A__) \
 || defined (__MSP430F67451__) || defined (__MSP430F67451A__) \
 || defined (__MSP430F6745__) || defined (__MSP430F6745A__) \
 || defined (__MSP430F67461__) || defined (__MSP430F67461A__) \
 || defined (__MSP430F6746__) || defined (__MSP430F6746A__) \
 || defined (__MSP430F67471__) || defined (__MSP430F67471A__) \
 || defined (__MSP430F6747__) || defined (__MSP430F6747A__) \
 || defined (__MSP430F67481__) || defined (__MSP430F67481A__) \
 || defined (__MSP430F6748__) || defined (__MSP430F6748A__) \
 || defined (__MSP430F67491__) || defined (__MSP430F67491A__) \
 || defined (__MSP430F6749__) || defined (__MSP430F6749A__) \
 || defined (__MSP430F67621__) || defined (__MSP430F67621A__) \
 || defined (__MSP430F67641__) || defined (__MSP430F67641A__) \
 || defined (__MSP430F67651__) || defined (__MSP430F67651A__) \
 || defined (__MSP430F6765__) || defined (__MSP430F6765A__) \
 || defined (__MSP430F67661__) || defined (__MSP430F67661A__) \
 || defined (__MSP430F6766__) || defined (__MSP430F6766A__) \
 || defined (__MSP430F67671__) || defined (__MSP430F67671A__) \
 || defined (__MSP430F6767__) || defined (__MSP430F6767A__) \
 || defined (__MSP430F67681__) || defined (__MSP430F67681A__) \
 || defined (__MSP430F6768__) || defined (__MSP430F6768A__) \
 || defined (__MSP430F67691__) || defined (__MSP430F67691A__) \
 || defined (__MSP430F6769__) || defined (__MSP430F6769A__) \
 || defined (__MSP430F67751__) || defined (__MSP430F67751A__) \
 || defined (__MSP430F6775__) || defined (__MSP430F6775A__) \
 || defined (__MSP430F67761__) || defined (__MSP430F67761A__) \
 || defined (__MSP430F6776__) || defined (__MSP430F6776A__) \
 || defined (__MSP430F67771__) || defined (__MSP430F67771A__) \
 || defined (__MSP430F6777__) || defined (__MSP430F6777A__) \
 || defined (__MSP430F67781__) || defined (__MSP430F67781A__) \
 || defined (__MSP430F6778__) || defined (__MSP430F6778A__) \
 || defined (__MSP430F67791__) || defined (__MSP430F67791A__) \
 || defined (__MSP430F6779__) || defined (__MSP430F6779A__) \
 || defined (__MSP430FG6425__) || defined (__MSP430FG6426__) \
 || defined (__MSP430FG6625__) || defined (__MSP430FG6626__)

// dedicated pin found, no setup needed, but need to dodge the catch-all #else below

#elif defined (__MSP430F5131__) || defined (__MSP430F5132__) \
 || defined (__MSP430F5151__) || defined (__MSP430F5152__) \
 || defined (__MSP430F5171__) || defined (__MSP430F5172__)

    PJSEL |= BIT5;

#elif defined (__MSP430F5212__) || defined (__MSP430F5214__) \
 || defined (__MSP430F5217__) || defined (__MSP430F5219__) \
 || defined (__MSP430F5222__) || defined (__MSP430F5224__) \
 || defined (__MSP430F5229__) || defined (__MSP430F5232__) \
 || defined (__MSP430F5234__) || defined (__MSP430F5237__) \
 || defined (__MSP430F5239__) || defined (__MSP430F5242__) \
 || defined (__MSP430F5244__) || defined (__MSP430F5247__) \
 || defined (__MSP430F5249__) || defined (__MSP430F5252__) \
 || defined (__MSP430F5253__) || defined (__MSP430F5254__) \
 || defined (__MSP430F5255__) || defined (__MSP430F5256__) \
 || defined (__MSP430F5257__) || defined (__MSP430F5258__) \
 || defined (__MSP430F5259__) || defined (__MSP430F5304__) \
 || defined (__MSP430F5308__) || defined (__MSP430F5309__) \
 || defined (__MSP430F5310__) || defined (__MSP430F5324__) \
 || defined (__MSP430F5325__) || defined (__MSP430F5326__) \
 || defined (__MSP430F5327__) || defined (__MSP430F5328__) \
 || defined (__MSP430F5329__) || defined (__MSP430F5340__) \
 || defined (__MSP430F5341__) || defined (__MSP430F5342__) \
 || defined (__MSP430F5500__) || defined (__MSP430F5501__) \
 || defined (__MSP430F5502__) || defined (__MSP430F5503__) \
 || defined (__MSP430F5504__) || defined (__MSP430F5505__) \
 || defined (__MSP430F5506__) || defined (__MSP430F5507__) \
 || defined (__MSP430F5508__) || defined (__MSP430F5509__) \
 || defined (__MSP430F5510__) || defined (__MSP430F5513__) \
 || defined (__MSP430F5514__) || defined (__MSP430F5515__) \
 || defined (__MSP430F5517__) || defined (__MSP430F5519__) \
 || defined (__MSP430F5521__) || defined (__MSP430F5522__) \
 || defined (__MSP430F5524__) || defined (__MSP430F5525__) \
 || defined (__MSP430F5526__) || defined (__MSP430F5527__) \
 || defined (__MSP430F5528__) || defined (__MSP430F5529__)

    P5SEL |= BIT4;

#elif defined (__CC430F5123__) || defined (__CC430F5125__) \
 || defined (__CC430F5133__) || defined (__CC430F5135__) \
 || defined (__CC430F5137__) || defined (__CC430F5143__) \
 || defined (__CC430F5145__) || defined (__CC430F5147__) \
 || defined (__CC430F6125__) || defined (__CC430F6126__) \
 || defined (__CC430F6127__) || defined (__CC430F6135__) \
 || defined (__CC430F6137__) || defined (__CC430F6147__)

    P5SEL |= BIT0;

#elif defined (__MSP430BT5190__) || defined (__MSP430F5418__) \
 || defined (__MSP430F5418A__) || defined (__MSP430F5419__) \
 || defined (__MSP430F5419A__) || defined (__MSP430F5435__) \
 || defined (__MSP430F5435A__) || defined (__MSP430F5436__) \
 || defined (__MSP430F5436A__) || defined (__MSP430F5437__) \
 || defined (__MSP430F5437A__) || defined (__MSP430F5438__) \
 || defined (__MSP430F5438A__)

    P7SEL |= BIT0;

#else
    #error "USE_XT1 was defined but pins not known in 'glue/MSP430F5xx_6xx/clock_pin.c'"
#endif
#endif

#ifdef USE_XT2
#if defined (__MSP430BT5190__) || defined (__MSP430F5212__) \
 || defined (__MSP430F5214__) || defined (__MSP430F5217__) \
 || defined (__MSP430F5219__) || defined (__MSP430F5222__) \
 || defined (__MSP430F5224__) || defined (__MSP430F5229__) \
 || defined (__MSP430F5232__) || defined (__MSP430F5234__) \
 || defined (__MSP430F5237__) || defined (__MSP430F5239__) \
 || defined (__MSP430F5242__) || defined (__MSP430F5244__) \
 || defined (__MSP430F5247__) || defined (__MSP430F5249__) \
 || defined (__MSP430F5252__) || defined (__MSP430F5253__) \
 || defined (__MSP430F5254__) || defined (__MSP430F5255__) \
 || defined (__MSP430F5256__) || defined (__MSP430F5257__) \
 || defined (__MSP430F5258__) || defined (__MSP430F5259__) \
 || defined (__MSP430F5304__) || defined (__MSP430F5308__) \
 || defined (__MSP430F5309__) || defined (__MSP430F5310__) \
 || defined (__MSP430F5324__) || defined (__MSP430F5325__) \
 || defined (__MSP430F5326__) || defined (__MSP430F5327__) \
 || defined (__MSP430F5328__) || defined (__MSP430F5329__) \
 || defined (__MSP430F5340__) || defined (__MSP430F5341__) \
 || defined (__MSP430F5342__) || defined (__MSP430F5418__) \
 || defined (__MSP430F5418A__) || defined (__MSP430F5419__) \
 || defined (__MSP430F5419A__) || defined (__MSP430F5435__) \
 || defined (__MSP430F5435A__) || defined (__MSP430F5436__) \
 || defined (__MSP430F5436A__) || defined (__MSP430F5437__) \
 || defined (__MSP430F5437A__) || defined (__MSP430F5438__) \
 || defined (__MSP430F5438A__) || defined (__MSP430F5500__) \
 || defined (__MSP430F5501__) || defined (__MSP430F5502__) \
 || defined (__MSP430F5503__) || defined (__MSP430F5504__) \
 || defined (__MSP430F5505__) || defined (__MSP430F5506__) \
 || defined (__MSP430F5507__) || defined (__MSP430F5508__) \
 || defined (__MSP430F5509__) || defined (__MSP430F5510__) \
 || defined (__MSP430F5513__) || defined (__MSP430F5514__) \
 || defined (__MSP430F5515__) || defined (__MSP430F5517__) \
 || defined (__MSP430F5519__) || defined (__MSP430F5521__) \
 || defined (__MSP430F5522__) || defined (__MSP430F5524__) \
 || defined (__MSP430F5525__) || defined (__MSP430F5526__) \
 || defined (__MSP430F5527__) || defined (__MSP430F5528__) \
 || defined (__MSP430F5529__)

    P5SEL |= BIT2;

#elif defined (__MSP430F5333__) || defined (__MSP430F5335__) \
 || defined (__MSP430F5336__) || defined (__MSP430F5338__) \
 || defined (__MSP430F5358__) || defined (__MSP430F5359__) \
 || defined (__MSP430F5630__) || defined (__MSP430F5631__) \
 || defined (__MSP430F5632__) || defined (__MSP430F5633__) \
 || defined (__MSP430F5634__) || defined (__MSP430F5635__) \
 || defined (__MSP430F5636__) || defined (__MSP430F5637__) \
 || defined (__MSP430F5638__) || defined (__MSP430F5658__) \
 || defined (__MSP430F5659__) || defined (__MSP430F6433__) \
 || defined (__MSP430F6435__) || defined (__MSP430F6436__) \
 || defined (__MSP430F6438__) || defined (__MSP430F6458__) \
 || defined (__MSP430F6459__) || defined (__MSP430F6630__) \
 || defined (__MSP430F6631__) || defined (__MSP430F6632__) \
 || defined (__MSP430F6633__) || defined (__MSP430F6634__) \
 || defined (__MSP430F6635__) || defined (__MSP430F6636__) \
 || defined (__MSP430F6637__) || defined (__MSP430F6638__) \
 || defined (__MSP430F6658__) || defined (__MSP430F6659__) \
 || defined (__MSP430FG6425__) || defined (__MSP430FG6426__) \
 || defined (__MSP430FG6625__) || defined (__MSP430FG6626__)

    P7SEL |= BIT2;

#else
    #error "USE_XT2 was defined but pins not known in 'glue/MSP430F5xx_6xx/clock_pin.c'"
#endif
#endif
}
